07_ruby_on_rails/d04/Myron_Johnson/after-hours/app/controllers/flash_cards_controller.rb

  def index
    @flashcards = FlashCard.all
---
SELECT "flash_cards".* FROM "flash_cards"

  def create
    puts '------------------------'
    puts params
    puts '------------------------'
    @flashcards = FlashCard.create(product_params)
---
INSERT INTO "flash_cards" ("question", "answer", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["question", "What is the square root of 4?"], ["answer", "2"], ["created_at", "2015-08-15 18:46:12.127276"], ["updated_at", "2015-08-15 18:46:12.127276"]]

  def delete
    puts '------------------------'
    puts params
    puts '------------------------'
    @flashcards = FlashCard.find(params[:flash_card][:id]).destroy
---
DELETE FROM "flash_cards" WHERE "flash_cards"."id" = $1  [["id", 1]]
SELECT  "flash_cards".* FROM "flash_cards" WHERE "flash_cards"."id" = $1 LIMIT 1  [["id", 1]]

  def random
    @flashcards = FlashCard.limit(1).order("RANDOM()")
---
SELECT  "flash_cards".* FROM "flash_cards"  ORDER BY RANDOM() LIMIT 1