07_ruby_on_rails/d04/Myron_Johnson/after-hours/app/controllers/sessions_controller.rb

  def create
    # post request to validate/create a session
    @user = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "myjohnson@gmail.com"]]