07_ruby_on_rails/d04/Myron_Johnson/after-hours/app/controllers/users_controller.rb

  def create
    # create users
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"